app/controllers/admin/categories_controller.rb

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES('111', '2010-02-26 06:34:03', '2010-02-26 06:34:03')

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
UPDATE "categories" SET "updated_at" = '2010-02-26 06:36:08', "name" = '11111' WHERE "id" = 1

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT * FROM "categories" WHERE ("categories"."id" = 2)
DELETE FROM "categories" WHERE "id" = 2