app/controllers/admin/contacts_controller.rb

  def edit
    @contact = Contact.first
---
SELECT * FROM "contacts" LIMIT 1