app/controllers/admin/tapes_controller.rb

  def index
    # @tapes = Tape.all
    @search = Tape.search(params[:search])
    @tapes = @search.paginate :page => params[:page], :per_page => 5
---
SELECT * FROM "tapes"
SELECT * FROM "tapes" WHERE ((tapes.title LIKE '%x%') OR (tapes.memo LIKE '%x%')) LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "tapes" WHERE ((tapes.title LIKE '%3%') OR (tapes.memo LIKE '%3%'))

  def show
    @tape = Tape.find(params[:id])
---
SELECT * FROM "tapes" WHERE ("tapes"."id" = 7)

  def edit
    @tape = Tape.find(params[:id])
---
SELECT * FROM "tapes" WHERE ("tapes"."id" = 1)

  def create
    @tape = Tape.new(params[:tape])

    respond_to do |format|
      if @tape.save
---
INSERT INTO "tapes" ("created_at", "photo_file_size", "title", "image_url", "updated_at", "photo_file_name", "memo", "photo_content_type", "photo_updated_at", "category_id") VALUES('2010-02-26 08:58:11', 75262, 'xxxxxxx', NULL, '2010-02-26 08:58:11', 'fish.jpg', '', 'image/jpeg', '2010-02-26 08:58:09', 1)

  def update
    @tape = Tape.find(params[:id])

    respond_to do |format|
      if @tape.update_attributes(params[:tape])
---
SELECT * FROM "tapes" WHERE ("tapes"."id" = 11)
UPDATE "tapes" SET "updated_at" = '2010-02-25 03:40:23', "photo_file_name" = 'child.jpg', "photo_file_size" = 22171, "photo_updated_at" = '2010-02-25 03:40:22' WHERE "id" = 14

  def destroy
    @tape = Tape.find(params[:id])
    @tape.destroy
---
SELECT * FROM "tapes" WHERE ("tapes"."id" = 1)
DELETE FROM "tapes" WHERE "id" = 1