app/controllers/admin/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "updated_at" = '2010-02-23 14:04:04', "hashed_password" = '1122', "name" = '22112' WHERE "id" = 2
---
   def update
     @user = User.find(params[:id])

     respond_to do |format|
       if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 1
---
   def destroy
     @user = User.find(params[:id])
     @user.destroy unless @user.name == 'yangyi'