app/controllers/contacts_controller.rb

SELECT * FROM "contacts"
---
  def index
    @contacts = Contact.all