app/controllers/pages_controller.rb

SELECT * FROM "categories"
SELECT * FROM "tapes"
SELECT * FROM "tapes" WHERE ((tapes.title LIKE '%1%') OR (tapes.memo LIKE '%1%')) LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "tapes"
---
  def index
    @title = "Home"
    if params[:category]
      @search = Tape.category_id_is(params[:category]).search(params[:search])
    else
      @search = Tape.search(params[:search])
    end
    @tapes = @search.paginate :page => params[:page], :per_page => 8

SELECT * FROM "contacts" LIMIT 1
---
  def contact
    @title = "Contact"
    # cache the contact
    @contact = session[:contact] ||= Contact.first